

exports = (function() {
	
	function test(raw, expected) {
		var tokens = window.reedy.advancedParser(raw);
		assert.equalArray(tokens[0].toHyphenated(), expected, raw);
	}
	
	
	var assert = require('../assert.js');
	
	
	assert.profile('hypens');
	
	test('снег',                                            ['снег']);
	
	test('Научно-Этического',                               ['Научно','Этического']);
	test('гуманитарно-этической',                           ['гуманитарно','этической']);
	test('Сказал-толкнул-упал-поднялся-разошлись',          ['Сказал','толкнул','упал','поднялся','разошлись']);
	
	test('speed_reading',                                   ['speed','reading']);
	test('Сказал_толкнул_упал_поднялся_разошлись',          ['Сказал','толкнул','упал','поднялся','разошлись']);
	
	test('удовлетворенности/неудовлетворенности',           ['удовле','творен','ности','неудовл','етворен','ности']);
	test('клановой/этнической/социальной/субкультурной',    ['клановой','этнической','социальной','субкультурной']);
	
	test('семидесятимиллионная',                            ['семидес','ятимилл','ионная']);
	
	return assert.profileEnd();
	
})();
