

exports = (function() {
	
	function check(raw, expected) {
		var tokens = window.reedy.parse3(raw),
			res = [], i;
		
		for (i = 0; i < tokens.length; i++) {
			res.push(tokens[i].toString())
		}
		
		assert.equalArray(res, expected);
	}
	
	
	var assert = require("../assert.js");
	
	
	assert.profile("parser3");
	
	check("перевод A. Préchac’а). Сочетание",               ["перевод","A. Préchac’а",")",".","Сочетание"]);
	check("ну У. Б. Йитс понятно теперь",                   ["ну","У. Б. Йитс","понятно","теперь"]);
	check("ну У. Б. Йитс У. понятно теперь",                ["ну","У. Б. Йитс","У",".","понятно","теперь"]);
	check("ну Й.К.Л. Прильвиц... понятно",                  ["ну","Й.К.Л. Прильвиц","...","понятно"]);
	
	check("перевод Préchac’а A.). Сочетание",               ["перевод","Préchac’а A.",")",".","Сочетание"]);
	check("ну Йитс У. Б. понятно теперь",                   ["ну","Йитс У. Б.","понятно","теперь"]);
	check("ну Йитс У.Б понятно теперь",                     ["ну","Йитс У.Б","понятно","теперь"]);
	check("ну Прильвиц Й.К.Л... понятно",                   ["ну","Прильвиц Й.К.Л","...","понятно"]);
	check("кричал:\n- Она",                                 ["кричал",":","-","Она"]);
	
	check("В полночь 25 марта 2014 года начался",           ["В","полночь","25","марта","2014","года","начался"]);
	check("для 50 000 пользователей",                       ["для","50","000","пользователей"]);
	check("Насчет Казанцевой... Неужели",                   ["Насчет","Казанцевой","...","Неужели"]);
	
	check("Глава 1 Глава 1.1 Команда А",                    ["Глава","1","Глава","1.1","Команда","А"]);
	check("в Киеве 20 февраля",                             ["в","Киеве","20","февраля"]);
	check("\"Уже 12 книг",                                  ["\"","Уже","12","книг"]);
	
	return assert.profileEnd();
	
})();
