

exports = (function() {
	
	function check(raw, expected) {
		var tokens = window.reedy.parse2(raw),
			res = [], i;
		
		for (i = 0; i < tokens.length; i++) {
			res.push(tokens[i].toString())
		}
		
		assert.equalArray(res, expected);
	}
	
	
	var assert = require("../assert.js");
	
	
	assert.profile("parser2");
	
	check("произошло что-то необычное. Лента.ру,",              ["произошло","что-то","необычное",".","Лента.ру",","]);
	check("произошло \"что-то\" необычное))) Однажды,",         ["произошло","\"","что-то","\"","необычное",")))","Однажды",","]);
	check("перевод A. Préchac’а). Сочетание",                   ["перевод","A",".","Préchac’а",")",".","Сочетание"]);
	check("перевод Й.К.Л. Прильвиц. Сочетание",                 ["перевод","Й.К.Л",".","Прильвиц",".","Сочетание"]);
	check("ну У.Б.Йитс понятно теперь",                         ["ну","У.Б.Йитс","понятно","теперь"]);
	check("перевод S.T.A.L.K.E.R Сочетание",                    ["перевод","S.T.A.L.K.E.R","Сочетание"]);
	check("был запущен в 30-е годы",                            ["был","запущен","в","30-е","годы"]);
	check("значит те 30-50 тысяч",                              ["значит","те","30-50","тысяч"]);
	check("значит аи92. Что",                                   ["значит","аи92",".","Что"]);
	check("Сказал-толкнул-упал-поднялся-разошлись.",            ["Сказал-толкнул-упал-поднялся-разошлись","."]);
	
	check("так считают 36%, по-моему уже",                      ["так","считают","36%",",","по-моему","уже"]);
	check("значит те -30°C что",                                ["значит","те","-30°C","что"]);
	check("значит те -30*2 что",                                ["значит","те","-30*2","что"]);
	check("значит это: -30*2. Что",                             ["значит","это",":","-30*2",".","Что"]);
	
	check("думает другое. +7 985 970-45-45. И собственно",      ["думает","другое",".","+7 985 970-45-45",".","И","собственно"]);
	check("думает другое +7 985 970-45-45 И собственно",        ["думает","другое","+7 985 970-45-45","И","собственно"]);
	check("думает другое:+7 (985) 970-45-45 И собственно",      ["думает","другое",":","+7 (985) 970-45-45","И","собственно"]);
	check("думает другое:7 985 970-45-45. И собственно",        ["думает","другое",":","7 985 970-45-45",".","И","собственно"]);
	check("думает другое. 7 (985) 970-45-45. И собственно",     ["думает","другое",".","7 (985) 970-45-45",".","И","собственно"]);
	check("думает другое: 123-45-67. И собственно",             ["думает","другое",":","123-45-67",".","И","собственно"]);
	check("думает другое:123-45-67. И собственно",              ["думает","другое",":","123-45-67",".","И","собственно"]);
	
	check("http://www.yandex.ru/",                              ["http://www.yandex.ru/"]);
	check("olegcherr@yandex.ru",                                ["olegcherr@yandex.ru"]);
	
	return assert.profileEnd();
	
})();
