

exports = (function() {
	
	function check(raw, expected) {
		var tokens = window.reedy.simpleParser(raw),
			res = [], i;
		
		for (i = 0; i < tokens.length; i++) {
			res.push(tokens[i].toString())
		}
		
		assert.equalArray(res, expected);
	}
	
	
	var assert = require("../assert.js");
	
	
	assert.profile("parser2");
	
	check("снег, у \" входа - елка.",                           ["снег,","у","\"","входа","-","елка."]);
	check("перевод A. Préchac’а). Сочетание",                   ["перевод","A.","Préchac’а).","Сочетание"]);
	check("ну Й.К.Л. Прильвиц... понятно",                      ["ну","Й.К.Л.","Прильвиц...","понятно"]);
	check("сказал \"ну, конечно ...\" и ушёл",                  ["сказал","\"ну,","конечно","...\"","и","ушёл"]);
	check("присутствующих, - …на двадцать",                     ["присутствующих,","-","…на","двадцать"]);
	
	check("произошло что-то необычное. Лента.ру,",              ["произошло","что-то","необычное.","Лента.ру,"]);
	check("был запущен в 30-е годы",                            ["был","запущен","в","30-е","годы"]);
	check("значит те 30-50 тысяч",                              ["значит","те","30-50","тысяч"]);
	check("Сказал-толкнул-упал-поднялся-разошлись.",            ["Сказал-толкнул-упал-поднялся-разошлись."]);
	
	check("так считают 36%, по-моему уже",                      ["так","считают","36%,","по-моему","уже"]);
	check("значит те -30°C что",                                ["значит","те","-30°C","что"]);
	check("значит это: -30*2. Что",                             ["значит","это:","-30*2.","Что"]);
	
	check("думает другое. +7 985 970-45-45. И собственно",      ["думает","другое.","+7","985","970-45-45.","И","собственно"]);
	check("думает другое:123-45-67. И собственно",              ["думает","другое:123-45-67.","И","собственно"]);
	
	check("http://www.yandex.ru/",                              ["http://www.yandex.ru/"]);
	check("olegcherr@yandex.ru",                                ["olegcherr@yandex.ru"]);
	
	check("кричал:\n- Она",                                     ["кричал:","-","Она"]);
	
	check("Глава 1 Глава 1.1 Команда А",                        ["Глава","1","Глава","1.1","Команда","А"]);
	
	return assert.profileEnd();
	
})();
